In [152]:
import numpy as np 
import pandas as pd

In [153]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [131]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [132]:
""""1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column)."""

'"1. Some values in the the FlightNumber column are missing. These numbers are\nmeant to increase by 10 with each row so 10055 and 10075 need to be put in\nplace. Fill in these missing numbers and make the column an integer column\n(instead of a float column).'

In [133]:
df.at[1,'FlightNumber']= 10055.00
df.at[3,'FlightNumber']= 10075.00
df = df.astype({'FlightNumber':'int'})

In [134]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [135]:
df.dtypes

From_To         object
FlightNumber     int32
RecentDelays    object
Airline         object
dtype: object

In [136]:
""""2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame."""

'"2. The From_To column would be better as two separate columns! Split each\nstring on the underscore delimiter _ to give a new temporary DataFrame with\nthe correct values. Assign the correct column names to this temporary\nDataFrame.'

In [137]:
df1=df.copy()

In [138]:
df1[['From','To']] = df1.From_To.str.split("_",expand=True)

In [139]:
df1

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

In [140]:
""" 3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".) """

' 3. Notice how the capitalisation of the city names is all mixed up in this\ntemporary DataFrame. Standardise the strings so that only the first letter is\nuppercase (e.g. "londON" should become "London".) '

In [141]:
df1['From'] = df1['From'].str.capitalize() 
df1['To'] = df1['To'].str.capitalize() 
df1['From_To'] = df1['From_To'].str.capitalize()

In [142]:
df1

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,London_paris,10045,"[23, 47]",KLM(!),London,Paris
1,Madrid_milan,10055,[],<Air France> (12),Madrid,Milan
2,London_stockholm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_paris,10075,[13],12. Air France,Budapest,Paris
4,Brussels_london,10085,"[67, 32]","""Swiss Air""",Brussels,London

In [143]:
"""4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions."""

'4. Delete the From_To column from df and attach the temporary DataFrame\nfrom the previous questions.'

In [144]:
df.drop(columns='From_To',inplace=True)

In [145]:
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [146]:
df = pd.concat([df,df1], axis=1)

In [147]:
df

,FlightNumber,RecentDelays,Airline,From_To,FlightNumber,RecentDelays,Airline,From,To
0,10045,"[23, 47]",KLM(!),London_paris,10045,"[23, 47]",KLM(!),London,Paris
1,10055,[],<Air France> (12),Madrid_milan,10055,[],<Air France> (12),Madrid,Milan
2,10065,"[24, 43, 87]",(British Airways. ),London_stockholm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,10075,[13],12. Air France,Budapest_paris,10075,[13],12. Air France,Budapest,Paris
4,10085,"[67, 32]","""Swiss Air""",Brussels_london,10085,"[67, 32]","""Swiss Air""",Brussels,London

In [148]:
"""5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays."""

"5. In the RecentDelays column, the values have been entered into the\nDataFrame as a list. We would like each first value in its own column, each\nsecond value in its own column, and so on. If there isn't an Nth value, the value\nshould be NaN.\nExpand the Series of lists into a DataFrame named delays, rename the columns\ndelay_1, delay_2, etc. and replace the unwanted RecentDelays column in df\nwith delays."

In [96]:
delays = df['RecentDelays'].apply(pd.Series)

In [97]:
delays

   RecentDelays  RecentDelays
0      [23, 47]      [23, 47]
1            []            []
2  [24, 43, 87]  [24, 43, 87]
3          [13]          [13]
4      [67, 32]      [67, 32]

In [34]:
delays.columns=['delay_{}'.format(x) for x in range(1,len(delays.columns)+1)]

In [64]:
delays
#Getting the recent delay values from the data frame
delays = pd.DataFrame(delays['RecentDelays'].values.tolist())

In [65]:
delays

              0             1
0      [23, 47]      [23, 47]
1            []            []
2  [24, 43, 87]  [24, 43, 87]
3          [13]          [13]
4      [67, 32]      [67, 32]

In [38]:
delays.columns

Index(['delay_1', 'delay_2'], dtype='object')

In [39]:
df = df.drop('RecentDelays', axis=1).join(delays)

KeyError: "['RecentDelays'] not found in axis"

In [37]:
df

,FlightNumber,Airline,From_To,FlightNumber,Airline,From,To,delay_1,delay_2
0,10045,KLM(!),London_paris,10045,KLM(!),London,Paris,"[23, 47]","[23, 47]"
1,10055,<Air France> (12),Madrid_milan,10055,<Air France> (12),Madrid,Milan,[],[]
2,10065,(British Airways. ),London_stockholm,10065,(British Airways. ),London,Stockholm,"[24, 43, 87]","[24, 43, 87]"
3,10075,12. Air France,Budapest_paris,10075,12. Air France,Budapest,Paris,[13],[13]
4,10085,"""Swiss Air""",Brussels_london,10085,"""Swiss Air""",Brussels,London,"[67, 32]","[67, 32]"

In [120]:
delays = df['RecentDelays'].apply(pd.Series)

delays.columns = ['delay_{}'.format(n) for n in range(1, len(delays.columns)+1)]

df = df.drop('RecentDelays', axis=1).join(delays)

In [121]:
df

,FlightNumber,Airline,From_To,FlightNumber,Airline,From,To,delay_1,delay_2
0,10045,KLM(!),London_paris,10045,KLM(!),London,Paris,"[23, 47]","[23, 47]"
1,10055,<Air France> (12),Madrid_milan,10055,<Air France> (12),Madrid,Milan,[],[]
2,10065,(British Airways. ),London_stockholm,10065,(British Airways. ),London,Stockholm,"[24, 43, 87]","[24, 43, 87]"
3,10075,12. Air France,Budapest_paris,10075,12. Air France,Budapest,Paris,[13],[13]
4,10085,"""Swiss Air""",Brussels_london,10085,"""Swiss Air""",Brussels,London,"[67, 32]","[67, 32]"

In [154]:
rows = []
df2 = df.apply(lambda row:[rows.append([row['Airline'], row['FlightNumber'],nn,row['From_To']])
for nn in row.RecentDelays], axis=1)

In [155]:
rows

[['KLM(!)', 10045.0, 23, 'LoNDon_paris'],
 ['KLM(!)', 10045.0, 47, 'LoNDon_paris'],
 ['(British Airways. )', 10065.0, 24, 'londON_StockhOlm'],
 ['(British Airways. )', 10065.0, 43, 'londON_StockhOlm'],
 ['(British Airways. )', 10065.0, 87, 'londON_StockhOlm'],
 ['12. Air France', nan, 13, 'Budapest_PaRis'],
 ['"Swiss Air"', 10085.0, 67, 'Brussels_londOn'],
 ['"Swiss Air"', 10085.0, 32, 'Brussels_londOn']]

In [158]:
df2 = pd.DataFrame(rows, columns=df.columns)

In [159]:
df2

               From_To  FlightNumber  RecentDelays           Airline
0               KLM(!)       10045.0            23      LoNDon_paris
1               KLM(!)       10045.0            47      LoNDon_paris
2  (British Airways. )       10065.0            24  londON_StockhOlm
3  (British Airways. )       10065.0            43  londON_StockhOlm
4  (British Airways. )       10065.0            87  londON_StockhOlm
5       12. Air France           NaN            13    Budapest_PaRis
6          "Swiss Air"       10085.0            67   Brussels_londOn
7          "Swiss Air"       10085.0            32   Brussels_londOn

In [160]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [161]:
df3 = pd.DataFrame(df['RecentDelays'].values.tolist())
df3

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [162]:
length_cols = df3.shape[1]

In [165]:
length_cols

3

In [166]:
df3.columns[2]

2

In [167]:
col_list=[]
col_dict={}
for i in range (length_cols):
    Key= df3.columns[i]
    Value="Delay"+str(i+1)
    col_dict[Key]=Value

In [168]:
col_dict

{0: 'Delay1', 1: 'Delay2', 2: 'Delay3'}

In [169]:
col_list

[]

In [170]:
df3.rename(columns=col_dict,inplace=True)

In [171]:
df3

   Delay1  Delay2  Delay3
0    23.0    47.0     NaN
1     NaN     NaN     NaN
2    24.0    43.0    87.0
3    13.0     NaN     NaN
4    67.0    32.0     NaN

In [172]:
df[["Delay1","Delay2","Delay3"]] = df3[["Delay1","Delay2","Delay3"]]

In [173]:
df

,From_To,FlightNumber,RecentDelays,Airline,Delay1,Delay2,Delay3
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),23.0,47.0,NaN
1,MAdrid_miLAN,NaN,[],<Air France> (12),NaN,NaN,NaN
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),24.0,43.0,87.0
3,Budapest_PaRis,NaN,[13],12. Air France,13.0,NaN,NaN
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",67.0,32.0,NaN

In [174]:
df.drop('RecentDelays',axis=1,inplace=True)
df

            From_To  FlightNumber              Airline  Delay1  Delay2  Delay3
0      LoNDon_paris       10045.0               KLM(!)    23.0    47.0     NaN
1      MAdrid_miLAN           NaN    <Air France> (12)     NaN     NaN     NaN
2  londON_StockhOlm       10065.0  (British Airways. )    24.0    43.0    87.0
3    Budapest_PaRis           NaN       12. Air France    13.0     NaN     NaN
4   Brussels_londOn       10085.0          "Swiss Air"    67.0    32.0     NaN

In [175]:
df.at[1,'FlightNumber']= 10055.00
df.at[3,'FlightNumber']= 10075.00
df = df.astype({'FlightNumber':'int'})

In [176]:
df

            From_To  FlightNumber              Airline  Delay1  Delay2  Delay3
0      LoNDon_paris         10045               KLM(!)    23.0    47.0     NaN
1      MAdrid_miLAN         10055    <Air France> (12)     NaN     NaN     NaN
2  londON_StockhOlm         10065  (British Airways. )    24.0    43.0    87.0
3    Budapest_PaRis         10075       12. Air France    13.0     NaN     NaN
4   Brussels_londOn         10085          "Swiss Air"    67.0    32.0     NaN

In [183]:
df1['From'] = df1['From'].str.capitalize() 
df1['To'] = df1['To'].str.capitalize() 
df['From_To'] = df['From_To'].str.capitalize()

In [184]:
df1=df.copy()

In [185]:
df1[['From','To']] = df1.From_To.str.split("_",expand=True)

In [186]:
df1

,From_To,FlightNumber,Airline,Delay1,Delay2,Delay3,From,To
0,London_paris,10045,KLM(!),23.0,47.0,NaN,London,paris
1,Madrid_milan,10055,<Air France> (12),NaN,NaN,NaN,Madrid,milan
2,London_stockholm,10065,(British Airways. ),24.0,43.0,87.0,London,stockholm
3,Budapest_paris,10075,12. Air France,13.0,NaN,NaN,Budapest,paris
4,Brussels_london,10085,"""Swiss Air""",67.0,32.0,NaN,Brussels,london

In [187]:
df=df1.copy()

In [188]:
df

,From_To,FlightNumber,Airline,Delay1,Delay2,Delay3,From,To
0,London_paris,10045,KLM(!),23.0,47.0,NaN,London,paris
1,Madrid_milan,10055,<Air France> (12),NaN,NaN,NaN,Madrid,milan
2,London_stockholm,10065,(British Airways. ),24.0,43.0,87.0,London,stockholm
3,Budapest_paris,10075,12. Air France,13.0,NaN,NaN,Budapest,paris
4,Brussels_london,10085,"""Swiss Air""",67.0,32.0,NaN,Brussels,london

In [189]:
df['From'] = df['From'].str.capitalize() 
df['To'] = df['To'].str.capitalize()

In [190]:
df

,From_To,FlightNumber,Airline,Delay1,Delay2,Delay3,From,To
0,London_paris,10045,KLM(!),23.0,47.0,NaN,London,Paris
1,Madrid_milan,10055,<Air France> (12),NaN,NaN,NaN,Madrid,Milan
2,London_stockholm,10065,(British Airways. ),24.0,43.0,87.0,London,Stockholm
3,Budapest_paris,10075,12. Air France,13.0,NaN,NaN,Budapest,Paris
4,Brussels_london,10085,"""Swiss Air""",67.0,32.0,NaN,Brussels,London

In [191]:
#THIS IS THE FINAL OUTCOME